# Pandas Basic

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [2]:
my_list = [0, 5, 10, 15, 20, 25, 30, 35, 40, 45]
my_series = pd.Series(my_list)
my_series

0     0
1     5
2    10
3    15
4    20
5    25
6    30
7    35
8    40
9    45
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:

| Name   | Age | Gender |
|--------|-----|--------|
| Alice  | 25  | Female |
| Bob    | 30  | Male   |
| Claire | 27  | Female |

Then, print the DataFrame.

In [3]:
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender': ['Female', 'Male', 'Female']}

df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

##### DataFrame is 2 dimensional size data structure. It looks like spreadsheet or sql table with rows and columns while pandas.series is  one-dimensional labeled array capable of holding any data type.

In [13]:
import pandas as pd
import numpy as np


col = ['A', 'B', 'C', 'D', 'E', 'F']
val = np.random.randint(0,15, (10,6))
data = {c: val for c in col}

q4_df = pd.DataFrame(data=val, columns=col)
q4_df

    A   B   C   D   E   F
0   8  10   6   6   7   9
1   7  10   8  13  13  13
2   2  14  13   8  12   1
3   5   4  12   1  14   0
4  11   9  10   1   5   6
5  10   2   7   5  14  10
6   3   4   1   2   6   1
7   1   9   9   6   4  14
8   4   6   3   8   6   6
9  13   8  12   6  13   1

In [18]:
data = np.random.randint(10,55, 10)
series = pd.Series(data)
series

0    42
1    16
2    33
3    52
4    50
5    48
6    47
7    25
8    22
9    30
dtype: int32

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

##### Some of the Common Pandas DataFrame Funtions:

- **.head() and .tail():** they are used to display the firs few rows or the last few rows of a DataFrame

    Example: 
    
        df.head(10) # to display the first 10 rows of a DataFrame
    
        df.tail(10) # to display the last 10 rows of a DataFrame


- **.info():** it used to get information about the DataFrame, including data types, non-null counts and memory usage.

    Example: 
    
        df.info() # to understand the structure and missing values in the data
        
- **.describe():** it used to generate summary statistics for numerical columns, including count, mean, std, min, max, and quartiles

    Example: 
    
        df.describe() # to provide an overview of the data distribution
        
- **.shape():** it used to get the number of rows and columns in the DataFrame

    Example: 
    
        df.shape() # to understand the DataFrame's dimensions

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

##### Among Series, DataFrame, and Panel, only DataFrame is mutable in nature.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [21]:
# Creating first Series and assign it to variable series1
series1 = pd.Series(['A', 'B', 'C', 'D', 'E', 'F'])

# Creating second Series and assign it to variable series2
series2 = pd.Series([20, 25, 30, 35, 40, 45])

# Combining the Series into a dictionary and assign it to a variable name data
data = {'Column1': series1, 'Column2':series2}

# Creatind a DataFrame from the dictionary named data
df = pd.DataFrame(data)

#displaying the DataFrame
df

  Column1  Column2
0       A       20
1       B       25
2       C       30
3       D       35
4       E       40
5       F       45